declare @year int = 2022
declare @month int = 12

declare @formT table (rowNum nvarchar(10), ds nvarchar(100), dsFrom nvarchar(10), dsTo nvarchar(10),
	dsLike nvarchar(100), dsName nvarchar(300))
insert into @formT values
	('1.', 'I00-I99', null, null, 'I%',
		N'<span style="background-color:lightblue;"><b>Болезни системы кровообращения всего, из них:</b></span>'),
	('1.1', 'I00-I02', null, null, 'I0[0-2]%', N'Острая ревматическая лихорадка'),
	('1.2', 'I05-I09', null, null, 'I0[5-9]%', N'Хронические ревматические болезни сердца'),
	('1.3', 'I11', null, null, 'I11%', N'Гипертоническая болезнь с преимущественным поражением сердца'),
	('1.4', 'I12', null, null, 'I12%', N'Гипертоническая болезнь с преимущественным поражением почек'),
	('1.5', 'I13', null, null, 'I13%', N'Гипертоническая болезнь с преимущественным поражением сердца и почек'),
	('1.6', 'I10', null, null, 'I10%', N'Другие формы гипертензии'),
	('1.6.N', null, null, null, null, N'<b>     Ишемическая болезнь сердца</b>'),
	('1.7', 'I21', null, null, 'I21%', N'Острый инфаркт миокарда'),
	('1.8', 'I22', null, null, 'I22%', N'Повторный инфаркт миокарда'),
	('1.9', 'I25', null, null, 'I25%', N'Атеросклеротическая болезнь сердца'),
	('1.10', 'I26-I28', null, null, 'I2[6-8]%', N'Легочное сердце и нарушения легочного кровообращения'),
	('1.11', 'I30-I51', 'I30', 'I51.9', null, N'Другие болезни сердца, из них:'),
	('1.12', 'I30', null, null, 'I30%', N'	острый перикардит'),
	('1.13', 'I33', null, null, 'I33%', N'	острый и подострый эндокардит'),
	('1.14', 'I40', null, null, 'I40%', N'	острый миокардит'),
	('1.15', 'I42', null, null, 'I42%', N'	кардиомиопатия'),
	('1.16', 'I26-I28', null, null, 'I2[6-8]%', N'Прочие болезни сердца'),
	('1.16.N', null, null, null, null, N'<b>     Цереброваскулярные болезни</b>'),
	('1.17', 'I60', null, null, 'I60%', N'Субарахноидальное кровоизлияние'),
	('1.18', 'I61-I62', null, null, 'I6[1-2]%', N'Внутримозговые и другие внутричерепные кровоизлияния'),
	('1.19', 'I63', null, null, 'I63%', N'Инфаркт мозга'),
	('1.20', 'I64', null, null, 'I64%', N'Инсульт, не уточненный как кровоизлияние или инфаркт'),
	('1.21', 'I65-I66', null, null, 'I6[5-6]%', N'Закупорка и стеноз прецеребральных, церебральных артерий, не приводящие к инфаркту мозга'),
	('1.22', 'I67-I69', null, null, 'I6[7-9]%', N'Прочие цереброваскулярные болезни'),
	('1.23', 'I70', null, null, 'I70%', N'Атеросклероз'),
	('1.24', 'I71-I79', null, null, 'I7[1-9]%', N'Другие болезни артерий, артериол и капилляров'),
	('1.25', 'I80-I82', null, null, 'I8[0-2]%', N'Флебит и тромбофлебит, тромбозы и эмболии'),
	('1.26', 'I83-I89', null, null, 'I8[3-9]%', N'Другие болезни вен и лимфатических сосудов'),
	('1.27', 'I95-I99', null, null, 'I9[5-9]%', N'Другие и неуточненные болезни системы кровообращения'),
	('2.', 'C00-C97, D00-D48', 'D00', 'D48.9', 'C%',
		N'<span style="background-color:lightblue;"><b>Новообразования всего, из них:</b></span>'),
	('2.1', 'C00-C14', 'C00', 'C14', null, N'Злокачественные новообразования губы, полости рта и глотки'),
	('2.1.N', null, null, null, null, N'<b>     Злокачественные органов пищеварения</b>'),
	('2.2', 'C15', null, null, 'C15%', N'Злокачественные новообразования пищевода'),
	('2.3', 'C16', null, null, 'C16%', N'Злокачественные новообразования желудка'),
	('2.4', 'C17', null, null, 'C17%', N'Злокачественные новообразования тонкого кишечника, включая двенадцатиперстную кишку'),
	('2.5', 'C18', null, null, 'C18%', N'Злокачественные новообразования ободочной кишки'),
	('2.6', 'C19-C21', 'C19', 'C21.9', null, N'Злокачественные новообразования прямой кишки, ректосигмоидного соединения, заднего прохода и анального канала'),
	('2.7', 'C22', null, null, 'C22%', N'Злокачественные новообразования печени и внутрипеченочных желчных протоков'),
	('2.8', 'C25', null, null, 'C25%', N'Злокачественные новообразования поджелудочной железы'),
	('2.9', 'C23, C24, C26', null, null, 'C2[346]%', N'Злокачественные новообразования других и неточно обозначенных локализаций органов пищеварения'),
	('2.9.N', null, null, null, null, N'<b>     Злокачественные органов дыхания</b>'),
	('2.10', 'C32', null, null, 'C32%', N'Злокачественные новообразования гортани'),
	('2.11', 'C33, C34', null, null, 'C3[34]%', N'Злокачественные новообразования трахеи, бронхов, легких'),
	('2.12', 'C30, C31, C37-C39', null, null, 'C3[01789]%', N'Злокачественные новообразования других и неточно обозначенных локализаций органов дыхания и грудной клетки'),
	('2.13', 'C40, C41', null, null, 'C4[01]%', N'Злокачественные новообразования костей и суставных хрящей'),
	('2.14', 'C43', null, null, 'C43%', N'Злокачественная меланома кожи'),
	('2.15', 'C44', null, null, 'C44%', N'Другие злокачественные новообразования кожи'),
	('2.16', 'C45-C49', null, null, 'C4[5-9]%', N'Злокачественные новообразования мезотелиальных и мягких тканей'),
	('2.16.N', null, null, null, null, N'<b>     Злокачественные женских половых органов</b>'),
	('2.17', 'C50', null, null, 'C50%', N'Злокачественные новообразования грудной железы'),
	('2.18', 'C53', null, null, 'C53%', N'Злокачественные новообразования шейки матки'),
	('2.19', 'C54, C55', null, null, 'C5[45]%', N'Злокачественные новообразования других и неуточненных частей матки'),
	('2.20', 'C56', null, null, 'C56%', N'Злокачественные новообразования яичника'),
	('2.21', 'C51, C52, C57, C58', null, null, 'C5[1278]%', N'Злокачественные новообразования других и неуточненных женских половых органов'),
	('2.21.N', null, null, null, null, N'<b>     Злокачественные мужских половых органов</b>'),
	('2.22', 'C61', null, null, 'C61%', N'Злокачественные новообразования предстательной железы'),
	('2.23', 'C60, C62, C63', null, null, 'C6[023]%', N'Злокачественные новообразования других мужских половых органов'),
	('2.23.N', null, null, null, null, N'<b>     Злокачественные мочевыводящих органов</b>'),
	('2.24', 'C64', null, null, 'C64%', N'Злокачественные новообразования почек'),
	('2.25', 'C67', null, null, 'C67%', N'Злокачественные новообразования мочевого пузыря'),
	('2.26', 'C65, C66, C68', null, null, 'C[568]%', N'Злокачественные новообразования других и неуточненных мочевых органов'),
	('2.26.N', null, null, null, null, N'<b>     Другие злокачественные новообразования кожи</b>'),
	('2.27', 'C70-C72', null, null, 'C7[0-2]%', N'Злокачественные новообразования мозговых оболочек, головного мозга, спинного мозга, черепно-мозговых нервов и других частей нервной системы'),
	('2.29', 'C81', null, null, 'C81%', N'Лимфома Ходжкина'),
	('2.30', 'C82-C85', null, null, 'C8[2-5]%', N'Неходжкинская лимфома'),
	('2.31', 'C90', null, null, 'C90%', N'Множественные миеломные и плазмоклеточные новообразования'),
	('2.32', 'C91-C95', null, null, 'C9[1-5]%', N'Лейкемия'),
	('2.33', 'C88, C96', 'C96', 'C96.9', 'C88%', N'Злокачественные новообразования других и неточно обозначенных, вторичных и неуточненных локализаций'),
	('2.34', 'D00-D48', 'D00', 'D48.9', null, N'Рак in situ, доброкачественные неопределенного и неизвестного характера новообразования'),
	('3.', 'G00-G98', 'G00', 'G98.9', null,
		N'<span style="background-color:lightblue;"><b>Болезни нервной системы всего, из них:</b></span>'),
	('3.1', 'G00, G03', null, null, 'G0[03]%', N'Менингит, за исключением менингита при инфекционных и паразитарных заболеваниях'),
	('3.2', 'G04, G06, G08, G09', null, null, 'G0[4689]%', N'Другие воспалительные болезни центральной нервной системы'),
	('3.3', 'G20, G21', null, null, 'G2[01]%', N'Болезнь Паркинсона'),
	('3.4', 'G30', null, null, 'G30%', N'Болезнь Альцгеймера'),
	('3.5', 'G35', null, null, 'G35%', N'Рассеянный склероз'),
	('3.6', 'G40, G41', null, null, 'G4[01]%', N'Эпилепсия'),
	('3.7', 'G80', null, null, 'G80%', N'Церебральный паралич'),
	('4.', 'J00-J99', null, null, 'J%',
		N'<span style="background-color:lightblue;"><b>Болезни органов дыхания всего, из них:</b></span>'),
	('4.1', 'J00-J06', null, null, 'J0[0-6]%', N'Острые респираторные инфекции верхних дыхательных путей, из них:'),
	('4.2', 'J04', null, null, 'J04%', N'	острый ларингит и трахеит'),
	('4.3', 'J05', null, null, 'J05%', N'	острый обструктивный ларингит [круп] и эпиглоттит'),
	('4.4', 'J09-J11', 'J09', 'J11.9', '', N'Грипп'),
	('4.4.N', null, null, null, null, N'<b>     Пневмония</b>'),
	('4.5', 'J12', null, null, 'J12%', N'Вирусная пневмония'),
	('4.6', 'J13-J15', null, null, 'J1[3-5]%', N'Бактериальная пневмония'),
	('4.7', 'J16', null, null, 'J16%', N'Другие острые пневмонии'),
	('4.8', 'J18', null, null, 'J18%', N'Пневмония без уточнения возбудителя'),
	('4.9', 'J20-J22', null, null, 'J2[0-2]%', N'Острые респираторные инфекции нижних дыхательных путей'),
	('4.9.N', null, null, null, null, N'<b>     Хронические заболевания нижних дыхательных путей</b>'),
	('4.10', 'J40', null, null, 'J40%', N'Бронхит (неуточненный как острый или хронический)'),
	('4.11', 'J43', null, null, 'J43%', N'Эмфизема'),
	('4.12', 'J41, J42, J44', null, null, 'J4[124]%', N'Другие хронические обструктивные заболевания легких'),
	('4.13', 'J45-J46', null, null, 'J4[56]%', N'Астма'),
	('4.14', 'J47', null, null, 'J47%', N'Бронхоэктатическая болезнь'),
	('4.15', 'J60-J70', 'J60', 'J70.9', null, N'Пневмокониозы и другие болезни легкого, вызванные внешними агентами'),
	('4.16', 'J80-J84', null, null, 'J8[0-4]%', N'Другие респираторные болезни, поражающие главным образом интерстициальную ткань (острый отек легкого, эозинофильная астма, пневмония Леффлера, диффузный и идеопатический легочный фиброз, интерстициальная пневмония без других указаний)'),
	('4.17', 'J85-J86', null, null, 'J8[56]%', N'Гнойные и некротические состояния нижних дыхательных путей (абсцесс легкого и средостения, гангрена и некроз легкого, абсцесс легкого с пневмонией эмпиема)'),
	('4.18', 'J85', null, null, 'J85%', N'	из них: острый панкреатит'),
	('4.19', 'J30-J39, J90-J99', null, null, 'J[39]%', N'Другие болезни органов дыхания'),
	('5.', 'K00-K39', 'K00', 'K39.9', null,
		N'<span style="background-color:lightblue;"><b>Болезни органов пищеварения всего, из них:</b></span>'),
	('5.0.N', null, null, null, null, N'<b>     Язва</b>'),
	('5.1', 'K25', null, null, 'K25%', N'Язва желудка'),
	('5.2', 'K26', null, null, 'K26%', N'Язва двенадцатиперстной кишки'),
	('5.3', 'K27', null, null, 'K27%', N'Пептическая язва, неуточненной локализации'),
	('5.4', 'K29', null, null, 'K29%', N'Другие гастриты и доудениты'),
	('5.5', 'K35-K38', null, null, 'K3[5-8]%', N'Болезни червеобразного отростка (аппендикса)'),
	('5.6', 'K40-K46', null, null, 'K4[0-6]%', N'Грыжи'),
	('5.7', 'K50-K52', null, null, 'K5[0-2]%', N'Неинфекционные энтериты и колиты'),
	('5.8', 'K56', null, null, 'K56%', N'Паралитический илеус и непроходимость кишечника без грыжи'),
	('5.8.N', null, null, null, null, N'<b>     Болезни печени</b>'),
	('5.9', 'K70', null, null, 'K70%', N'Алкогольная болезнь печени (алкогольный: цирроз, гепатит, фиброз)'),
	('5.10', 'K74', null, null, 'K74%', N'Фиброз и цирроз печени (кроме алкогольного)'),
	('5.11', 'K71-K73, K75-K76', null, null, 'K7[12356]%', N'Другие болезни печени'),
	('5.11.N', null, null, null, null, N'<b>     Желчно-каменная болезнь и холецистит</b>'),
	('5.12', 'K80', null, null, 'K80%', N'Желчно-каменная болезнь (холелитиаз)'),
	('5.13', 'K81', null, null, 'K81%', N'Холецистит'),
	('5.14', 'K85-K86', null, null, 'K8[56]%', N'Острый панкреатит и другие болезни поджелудочной железы'),
	('6.', '', null, null, '%', N'<span style="background-color:lightblue;"><b>ВСЕГО</b></span>')

declare @sampleT table (sl_ds1 nvarchar(10), sl_id int, sl_povod int, zsl_usl_ok int, zsl_for_pom int, usl_code_usl nvarchar(20)) 
insert into @sampleT
	select sl.DS1, sl.ID, sl.POVOD, zsl.USL_OK, zsl.FOR_POM, usl.CODE_USL
	from D3_SL_OMS sl
		left join D3_ZSL_OMS zsl on zsl.ID = sl.D3_ZSLID
		left join D3_PACIENT_OMS p on p.ID = zsl.D3_PID
		left join D3_USL_OMS usl on usl.D3_SLID = sl.ID
		join D3_SCHET_OMS sc on zsl.D3_SCID = sc.ID and sc.YEAR = @year and sc.MONTH = @month
	where sl.D3_ZSLID <> '' and sc.ID <> ''	and floor(datediff(day, p.DR, zsl.DATE_Z_1) / 365.25) > 60

declare @form_sampleT table (dsName nvarchar(300), rowNum nvarchar(10), ds nvarchar(100),
	sl_id int, sl_povod int, zsl_usl_ok int, zsl_for_pom int, usl_code_usl nvarchar(20))
insert into @form_sampleT
	select dsName, rowNum, ds, sl_id, sl_povod, zsl_usl_ok, zsl_for_pom, usl_code_usl
	from @formT f
		left join @sampleT on
			sl_ds1 between f.dsFrom and f.dsTo
			or sl_ds1 like f.dsLike
	union all
	select N'Злокачественные новообразования щитовидной железы', '2.28', 'C69, C73-C80, C97',
		sl_id, sl_povod, zsl_usl_ok, zsl_for_pom, usl_code_usl
	from @sampleT
	where sl_ds1 like 'C69%'
		or sl_ds1 like 'C97%'
		or sl_ds1 between 'C73' and 'C80.9'
	union all
	select N'Прочие нарушения нервной системы', '3.8', 'G10-G12, G23-G25, G31, G36, G37, G43-G45, G47, G50-G72, G81-G98',
		sl_id, sl_povod, zsl_usl_ok, zsl_for_pom, usl_code_usl
	from @sampleT
	where sl_ds1 like 'G1[0-2]%'
		or sl_ds1 like 'G2[3-5]%'
		or sl_ds1 like 'G3[167]%'
		or sl_ds1 like 'G4[3457]%'
		or sl_ds1 between 'G50' and 'G72.9'
		or sl_ds1 between 'G81' and 'G98.9'
	union all
	select N'Прочие болезни органов пищеварения', '5.15', 'K00-K14, K20-K24, R28, K30-K31, K55, K57-K66, K82, K83, K90-K93',
		sl_id, sl_povod, zsl_usl_ok, zsl_for_pom, usl_code_usl
	from @sampleT
	where sl_ds1 like 'K2[0-48]%'
		or sl_ds1 like 'K3[01]%'
		or sl_ds1 like 'K5[57-9]%'
		or sl_ds1 like 'K6[0-6]%'
		or sl_ds1 like 'K8[23]%'
		or sl_ds1 like 'K9[0-3]%'

select iif(right(rowNum, 1) = 'N', '', rowNum) as rowNum,dsName,ds,
    -- амбул-поликл - обращения в связи с заболеванием
    case when ds is not null then
        count(distinct case when zsl_usl_ok = 3 and (
            (sl_povod = 30 and try_cast(usl_code_usl as int) in (6,31,32,33,34,35,38,39,3031,3032,3033,3034,3035,3038,3039))
                or
            (sl_povod = 50 and try_cast(usl_code_usl as int) in (4070,4071) or try_cast(usl_code_usl as int) between 4201 and 4216))
            then sl_id end)
    end as c3,
    -- амбул-поликл - разовое посещение в связи с заболеванием
    case when ds is not null then
	    count(distinct case when zsl_usl_ok = 3 and sl_povod = 1 and
	    try_cast(usl_code_usl as int) in (1,2,3,5,6,7,8,19,20,12,3001,3002,3005,3007,3008,3019,3020,3003,4057,4058,4059,4060,4061)
		then sl_id end)
	end as c4,
    -- стационар - плановая госпитализация
    case when ds is not null then count(distinct case when zsl_usl_ok = 1 and zsl_for_pom = 3 then sl_id end) end as c5,
    -- стационар - экстренная госпитализация
    case when ds is not null then count(distinct case when zsl_usl_ok = 1 and zsl_for_pom = 1 then sl_id end) end as c6,
    -- стационарозамещ
    case when ds is not null then count(distinct case when zsl_usl_ok = 2 then sl_id end) end as c7,
    -- скорой вне МО
    case when ds is not null then count(distinct case when zsl_usl_ok = 4 then sl_id end) end as c8
from @form_sampleT
group by rowNum, dsName, ds
order by
	case when charindex('.', rowNum) = 0
		then rowNum
		else cast(substring(rowNum, 1, charindex('.', rowNum)-1) as int)
	end,
	case when charindex('.', rowNum, charindex('.', rowNum)+1) = 0
		then cast(substring(rowNum, charindex('.', rowNum)+1, len(rowNum)-charindex('.', rowNum)) as int)
		else substring(rowNum, charindex('.', rowNum)+1, charindex('.', rowNum, charindex('.', rowNum)+1)-charindex('.', rowNum)-1)
	end,
	case when charindex('.', rowNum, charindex('.', rowNum)+1) > 0 then
		substring(rowNum, charindex('.', rowNum, charindex('.', rowNum)+1)+1, len(rowNum)-charindex('.', rowNum, charindex('.', rowNum)+1))
	end